Revit 2024 API
BuiltInFailures.MechanicalFailures.LiningThicknessIsLargeForWidth Property
 Lining Thickness ([Lining Thickness Value]) is too large for current Width ([Width Value]).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LiningThicknessIsLargeForWidth { get; }
Visual Basic
Public Shared ReadOnly Property LiningThicknessIsLargeForWidth As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LiningThicknessIsLargeForWidth {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MechanicalFailures Class
Autodesk.Revit.DB Namespace